app/views/entries/_form.html.erb

    <div class="select">
    <%= form.select :category_id, Category.user_categories(current_user).collect  {|u| [u.title, u.id]} %>
---
SELECT "categories".* FROM "categories" WHERE (user_id = 1)