app/controllers/entries_controller.rb

INSERT INTO "entries" ("created_at", "updated_at", "category_id", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2023-04-09 21:32:22.362630"], ["updated_at", "2023-04-09 21:32:22.362630"], ["category_id", 21], ["user_id", 1]]
---
  def create
    @entry = Entry.new(entry_params)
    @entry.user = current_user

    respond_to do |format|
      if @entry.save

UPDATE "entries" SET "category_id" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["category_id", 5], ["updated_at", "2020-11-23 19:57:51.251309"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @entry.update(entry_params)