app/controllers/reminders_controller.rb

  def create
    @reminder = Reminder.new(reminder_params)
    @reminder.user = current_user

    respond_to do |format|
      if @reminder.save
---
INSERT INTO "reminders" ("reminder", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["reminder", "Have to submit CW"], ["created_at", "2023-04-10 10:51:57.867119"], ["updated_at", "2023-04-10 10:51:57.867119"], ["user_id", 1]]

  def destroy
    @reminder.destroy
---
DELETE FROM "reminders" WHERE "reminders"."id" = ?  [["id", 1]]

    def set_reminder
      @reminder = Reminder.find(params[:id])
---
SELECT  "reminders".* FROM "reminders" WHERE "reminders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]